trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="066e30f6-7b05-4707-b88c-048e47e0ee62">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3e5dfce-ce94-489f-bbc6-ba1b699e6a56">
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7afe322-1954-42ee-b9f7-20803df9f4db">
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="942b70ab-8729-495e-aa2e-e362fab7ecfd">
    <name>ТипСкладскойЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c08d78e7-8199-4896-a9fc-9ac0cb946bff">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60091b4d-b59a-402b-8b0a-8f53fca6515a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56a97705-349f-4913-8e45-02a642ba3195">
    <name>ПорядокОбхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc923ed7-93a9-4ab2-80bf-95d378dac70c">
    <name>Позиция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82b6a5ac-4bdb-4046-b405-1382915a4c74">
    <name>УровеньДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4a34412-3576-4048-b17b-40befc421c3f">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61217d52-e955-4b33-bc99-11d43aa1c1d9">
    <name>ОбластьХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63793c84-fe0a-46a7-b089-23086db66ef4">
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45830319-bd9f-49d6-afc3-425511de0559">
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СоздатьЯчейки

Процедура СоздатьЯчейки(Отказ, Товары, Склад, РабочийУчасток) Экспорт
	Если Не Отказ И ЗначениеЗаполнено(Товары) И ЗначениеЗаполнено(Склад) И ЗначениеЗаполнено(РабочийУчасток) Тогда 
		Если Склад.Наименование = "Центральный склад" Тогда
			Если СравнитьСтроки(РабочийУчасток.Наименование, "Секция А") Тогда
				СоздатьЗаписи(Товары, "Центральный склад", "Секция А", "Секция А (Общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция С") Тогда
				СоздатьЗаписи(Товары, "Центральный склад", "Секция С", "Секция С (Общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция Д") Тогда
				СоздатьЗаписи(Товары, "Центральный склад", "Секция Д", "Секция Д (Общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция М") Тогда
				СоздатьЗаписи(Товары, "Центральный склад", "Секция М", "Секция М (Общая)");
			КонецЕсли;
		ИначеЕсли Склад.Наименование = "Склад (Выбор)" Тогда
			Если СравнитьСтроки(РабочийУчасток.Наименование, "Секция А") Тогда
				СоздатьЗаписи(Товары, "Склад (Выбор)", "Секция А", "Секция А (общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция В.С") Тогда
				СоздатьЗаписи(Товары, "Склад (Выбор)", "Секция В.С", "Секция В.С (общая)");
			КонецЕсли;
		ИначеЕсли Склад.Наименование = "Склад (Барнаул)" Тогда
			Если СравнитьСтроки(РабочийУчасток.Наименование, "Секция В") Тогда  
				СоздатьЗаписи(Товары, "Склад (Барнаул)", "Секция В", "СекцияВ+Метал(общая");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция Металл") Тогда
				СоздатьЗаписи(Товары, "Склад (Барнаул)", "Секция В", "СекцияВ+Метал(общая");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция С") Тогда     
				СоздатьЗаписи(Товары, "Склад (Барнаул)", "Секция С", "Секция С(Общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция А") Тогда 
				СоздатьЗаписи(Товары, "Склад (Барнаул)", "Секция А", "Секция А (общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция Д") Тогда          
				СоздатьЗаписи(Товары, "Склад (Барнаул)", "Секция Д (Барнаул)", "Секция Д (общая)");
			КонецЕсли;
		ИначеЕсли Склад.Наименование = "Склад (Бийск)" Тогда
			Если СравнитьСтроки(РабочийУчасток.Наименование, "Секция А") Тогда  
				СоздатьЗаписи(Товары, "Склад (Бийск)", "Секция A", "Секция А (общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция В") Тогда   
				СоздатьЗаписи(Товары, "Склад (Бийск)", "Секция B", "Секция В (общая)");
			ИначеЕсли СравнитьСтроки(РабочийУчасток.Наименование, "Секция С") Тогда  
				СоздатьЗаписи(Товары, "Склад (Бийск)", "Секция С", "Секция С (общая)");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьЗаписи(Товары, Склад, РабочийУчасток, Ячейка)  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладскиеЯчейки.Ссылка КАК Ячейка,
		|	СкладскиеЯчейки.Владелец КАК Склад
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	НЕ СкладскиеЯчейки.ПометкаУдаления
		|	И СкладскиеЯчейки.Код = &Ячейка
		|	И СкладскиеЯчейки.РабочийУчасток.Наименование = &РабочийУчасток
		|	И СкладскиеЯчейки.Владелец.Наименование = &Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЯчейка
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО СпрНоменклатура.Ссылка = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад.Наименование = &Склад)
		|ГДЕ
		|	СпрНоменклатура.Ссылка В(&Товары)
		|	И НЕ СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)";
		
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("РабочийУчасток", РабочийУчасток);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Товары", Товары);     
	
	Результат = Запрос.ВыполнитьПакет();     
	Выборка = Результат[0].Выбрать();
	Если Выборка.Следующий() Тогда  
		Склад = Выборка.Склад;
		Ячейка = Выборка.Ячейка; 
		Если ЗначениеЗаполнено(Склад) И ЗначениеЗаполнено(Ячейка) Тогда				
			Выборка = Результат[1].Выбрать();
			Пока Выборка.Следующий() Цикл 
				Если Не Выборка.ЕстьЯчейка Тогда          
					МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Склад = Склад;
					МенеджерЗаписи.Ячейка = Ячейка;
					МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
					МенеджерЗаписи.ОсновнаяЯчейка = Истина;
		
					Попытка
						МенеджерЗаписи.Записать();
					Исключение 
						ОбщегоНазначения.СообщитьПользователю("Не удалось создать ячейку для '" + Выборка.Номенклатура + "'");
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

Функция СравнитьСтроки(Знач Строка1, Знач Строка2)
	Строка1 = ИнтеграцияИСКлиентСервер.ЗаменитьНечитаемыеСимволы(ВРег(Строка1));
	Строка2 = ИнтеграцияИСКлиентСервер.ЗаменитьНечитаемыеСимволы(ВРег(Строка2));

	Строка1 = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("АВЕКМНОРСТУХ", Строка1, "ABEKMHOPCTYX");
	Строка2 = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("АВЕКМНОРСТУХ", Строка2, "ABEKMHOPCTYX");

	Возврат Строка1 = Строка2;
КонецФункции 

#КонецОбласти   

#КонецЕсли
